import numpy as np

# 一、创建数组

## 1、np.array() 
d1 = [1,2.3,4,5,0,1]
a1 = np.array(d1)       # array([1,2.3,4,5,0,1] )
d2 = [[1,2,3],[4,5,6]]
a2 = np.array(d2)       # array([[1,2,3],[4,5,6]])

## 2、np.zeros()
### 创建后用0填充
### 等同于np.zeros([3,6])
d3 = np.zeros((3,6))    # array([[ 0.,  0.,  0.,  0.,  0.,  0.],
                        #        [ 0.,  0.,  0.,  0.,  0.,  0.],
                        #        [ 0.,  0.,  0.,  0.,  0.,  0.]])
d4 = np.zeros([5,])     # array([ 0.,  0.,  0.,  0.,  0.])

## 3、np.aranges()
### 创建后并按序号填充
d5 = np.aranges(5)      # array([0,1,2,3,4])

