# 一、通用函数 快速的元素级数组函数
## 通用函数即ufunc 是一种对ndarray中的数据执行元素级运算的函数。
## 1、一元ufunc  (即接收一个数组参数，如sqrt和exp)
u1 = np.arange(10)      # array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])
np.sqrt(u1)             # 按元素方式返回数组的正平方根。
### array([ 0., 1., 1.4142, 1.7320, 2., 2.2360, 2.4494, 2.6457, 2.8284, 3.])
np.exp(u1)              # 计算输入数组中所有元素的指数。
### array([  1.00000000e+00,   2.71828183e+00,   7.38905610e+00,
###          2.00855369e+01,   5.45981500e+01,   1.48413159e+02,
###          4.03428793e+02,   1.09663316e+03,   2.98095799e+03,
###          8.10308393e+03])

### 更多一元ufunc查看书本  abs/fabs/sqrt/square/exp/log/log10/log2....

## 2、二元ufunc  (即接收两个数组参数，如add和maximum)
u2 = np.random.randn(8)
u3 = np.random.randn(8)
u4 = np.maximum(u2,u3)   # 比较两个数组并返回一个包含元素级最大值的新数组。
### array([ 0.42252405,  0.03190768,  0.77854621, -0.71822114,  1.18094642,
###        -0.43090698,  0.79106801, -0.10439895])

### 更多二元ufunc查看书本  add/subtract/multiply/power/mod/less....
